{
  "cheatsheet.nvim": { "branch": "master" },
  "dashboard-nvim": { "branch": "master" },
  "dressing.nvim": { "branch": "master" },
  "flatten.nvim": { "branch": "main" },
  "fold-preview.nvim": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "harpoon": { "branch": "harpoon2" },
  "hlargs.nvim": { "branch": "main" },
  "keymap-amend.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "leap.nvim": { "branch": "main" },
  "leetcode.nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "mason.nvim": { "branch": "main" },
  "mini.nvim": { "branch": "main" },
  "mkdir.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-scrollview": { "branch": "main" },
  "nvim-tetris": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "search-replace.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tree-sitter-nu": { "branch": "main" },
  "treesj": { "branch": "main" },
  "twilight.nvim": { "branch": "main" },
  "usage-tracker.nvim": { "branch": "main" },
  "vim-be-good": { "branch": "master" },
  "vim-code-dark": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}